/***************************************************
*                                          公共库
*
*    TODU
*         延时函数：增加延时类别
***************************************************/

#include "common.h"

void delay(char num)
{
/***********************
*   延时函数
*
*   参数：延时时间
*    返回：空
*
************************/
	int i,j;
	while(num){
		for(i=200;i>0;i--)
			for(j=200;j>0;j--);
		num--;
	}
	return;
}

void delay_ms(int num)
{
	/***********************
	*   延时函数
	*
	*   参数：延时时间
	*    返回：空
	*
	************************/
	char j;
	while(num){
		for(j=40; j>0; j--);
		num--;
	}
	return;
}
